<template>
  <div>
    <h2>О приложении</h2>
    <hr />
    <p>
      Данный сайт создвался в рамках урока по фреймворку Vue 3. При разработке
      приложения использованы такие инструменты как:
    </p>
    <ul>
      <li>Интерполяция</li>
      <li>Директива V-ON. Слушатели событий</li>
      <li>Vue devtools. Инструменты разработчика</li>
      <li>Cтили. Отрисовка в цикле</li>
      <li>Директива V-FOR Создание нового поста</li>
      <li>Двустороннее связывание</li>
      <li>Модификаторы stop, prevent</li>
      <li>Декомпозиция</li>
      <li>Создание переиспользуемых компонентов. Props</li>
      <li>Передача данных в компонент V-MODEL</li>
      <li>$emit. Обмен данными между дочерним и родительским компонентом</li>
      <li>Библиотека UI компонентов</li>
      <li>Глобальная регистрация компонента</li>
      <li>Отрисовка по условию</li>
      <li>Модальное окно</li>
      <li>Работа с сервером. Axios</li>
      <li>Жизненный цикл компонента ндикатор загрузки данных</li>
      <li>Выпадающий список</li>
      <li>Сортировка постов</li>
      <li>Наблюдаемые WATCH и вычисляемые COMPUTED</li>
      <li>Анимации transition group</li>
      <li>Поиск постов. Фильтрация</li>
      <li>Пагинация. Постраничный вывод. Динамическая пагинация</li>
      <li>Intersection API Refs</li>
      <li>Доступ к DOM элементу VUE-ROUTER</li>
      <li>Собственные директивы V-INTERSACTION и V-FOCUS Mixins</li>
    </ul>
  </div>
</template>

<script>
export default {};
</script>

<style>
ul {
  margin-left: 20px;
}
</style>
